12/data/attachments/3071aead1dab3c16.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Joseph_training_Friend_16859_9</nif:username>
            <nif:friendToBeRequested>soap_friends_fd25bb4d-253c-4c0f-9cdd-228e9f773737</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>